int main()
{
	// 연산자
	// 대입 연산자: =
	// 산술 연산자
	// +, -, *, /, %(모듈러스, 나머지, 피연산자가 모두 정수)
	// ++, -- (증감 연산자): 한 단계 증가 또는 감소
	// 정수, 실수에서는 +1 증가, -1 감소로 볼 수 있다.

	// 논리 연산자
	// !(역), &&(and), ||(or)
	// 참(true), 거짓(false)
	// 참  : 0 이 아닌 값, 주로 1
	// 거짓: 0
	// bool 자료형은 참과 거짓만 다루기 때문에 수치로 표현하면 0 과 1 로만 표현된다.
	
	// 비교 연산자
	// ==, !=, <, <=, >, >=
	// 참, 거짓

	// 구문
	// if, else
	int data = 0;
	
	if (0 && 200)
	{
		data = 100; // 조건이 참인 경우 실행문.
	}

	if (data == 100)
	{
		// if 가 참인 경우 수행.
	}
	else
	{
		// if 가 거짓인 경우 수행.
	}

	if () // 4개의 조건중 하나라도 참이면 다음 조건문을 읽지 않고 실행문 수행.
	{

	}
	else if ()
	{

	}
	else if ()
	{

	}
	else if ()
	{

	}
	else // 4개의 조건이 모두 거짓인 경우 수행.
	{

	}

	return 0;

}